// 必要な変数を定義する (02)


function preload() {
    // 画像を読み込む (02)

}

function setup() {
    createCanvas(500, 500);
    imageMode(CENTER);

    // 変数を初期化する (02)

}

function draw() {
    background("lightblue");

    if (mode == 0) {
        // スタート画面の表示 (03)

    }

    if (mode == 1) {
        // かごを動かす (04)

        
        // 一定時間おきにりんごを増やす (06)
        
        
        // りんごを落とす (05)
        
        
        // かごとりんごが重なったら (07)
        
        
        // りんごを表示する (05)
        
        
        // かごを表示する (04)
        
        
        // スコアを表示する (08)
        
        
        // 時間を表示する (08)
        
        
        // 時間切れでゲームを終了する (09)

    }

    if (mode == 2) {
        // 終了画面の表示 (09)
        
    }
}
